[
  {
    "name": "BRUEMI",
    "img": 1,
    "summary": "VSLAM기반 자율주행 서비스 로봇은 실내에서 물건을 전달해주는 수요응답형 서비스 로봇입니다. 로봇은 실내 지도작성, 위치추정, 장애물 회피 기능을 수행합니다. 천장을 보는 카메라를 이용하여 VSLAM을 사용하기에 빠르게 지도작성을 수행하고 초기세팅시간이 짧은 장점이 있습니다.",
    "background": [
      "저는 기술이 사회에 긍정적인 영향을 미칠 수 있다는 확신을 가지고 있습니다. 현재 사회에서는 고령화, 인력 부족, 비대면 서비스의 필요성 등 다양한 이슈가 존재합니다. 이러한 문제들을 해결하기 위해선 새로운 접근 방식이 필요하다고 생각했습니다. 그 중 하나로 로봇 기술이 주목받고 있었습니다. 하지만 대부분의 로봇은 가격이 비싸거나 복잡한 기능 때문에 일반 소비자들이 접하기 어려운 상황이었습니다. 따라서 보급형 서비스 로봇 개발 프로젝트에 참여하여 일반 사용자도 쉽게 사용할 수 있는 서비스를 제공하고자 했습니다. 이를 통해 보다 많은 사람들이 로봇 기술의 혜택을 누릴 수 있게 되었다는 것은 큰 의미가 있다고 생각합니다.",
      "개인적으로 프론트엔드 개발자로서 사용자 경험과 인터랙션에 집중하는 것을 중요하게 생각합니다. 이번 프로젝트에서 호출, 배송, 취소, 대기열 등록 등의 다양한 기능을 웹 환경에서 구현함으로써 사용자와 로봇 간의 원활한 상호작용을 가능하게 하는 역할을 수행할 수 있었습니다. 위와 같은 계기로 이 프로젝트를 시작하였으며, 실제 개발 과정에서도 사용자 중심적인 디자인과 효율적인 코드 작성에 초점을 맞추어 진행되었습니다."
    ],
    "": [],
    "fe": "Front-End : JavaScript, React, Canvas, Swiper, ws module, audio-player, Sass, styled-components, MUI",
    "be": "Back-End : Node.js, Express, MySQL, ws module, fs module",
    "role": [
      "Full-Stack : 1명",
      "영상처리 : 1명",
      "임베디드 : 2명",
      "자율주행 : 2명"
    ],
    "function": ["호출", "취소 & 녹음", "로그인", "회원가입"],
    "function2": [
      "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaabbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbaaaaaaaaaaaaaa",
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb"
    ]
  },
  {
    "name": "T:LENS",
    "img": 2,
    "summary": "T:LENS는 키워드를 통해 실시간 트렌드를 쉽게 파악하고 싶은 사람과 기자별 맞춤형 구독 서비스가 필용한 사용자를 위한 실시간 크롤링 및 분산 처리를 통해 뉴스 트렌드를 종합하고 시각화하는 서비스입니다.",
    "background": [
      "뉴스는 현대 사회에서 매우 중요한 정보원으로 작용합니다. 사람들은 뉴스를 통해 최신 동향, 이슈, 경제 상황 등 다양한 정보를 얻고 소통하며 의사 결정을 내립니다. 하지만 너무 많은 뉴스가 생산되고 있어서 사용자들이 관심 있는 주제를 식별하고 핵심적인 내용을 파악하기 어려워지는 문제가 있습니다. 그래서 저는 뉴스 트렌드 분석 서비스 프로젝트에 참여하여 이 문제를 해결하고자 했습니다. 사용자들이 최신 뉴스의 핵심적인 내용과 트렌드를 쉽게 파악할 수 있는 도구를 개발하여 제공함으로써, 사용자들의 시간과 노력을 절약하고 정확한 정보에 접근할 수 있도록 하고자 했습니다.",
      "저는 데이터 시각화와 인터랙션에 큰 관심을 가지고 있습니다. 프론트엔드 개발자로서 사용자 경험(UX)을 개선하기 위해 직관적이고 시각적으로 매력적인 인터페이스를 구현하는 것이 중요하다고 생각합니다. 따라서 이 프로젝트에서도 다양한 데이터 시각화 기법과 인터랙션 요소들을 활용하여 사용자들이 즐겁게 서비스를 이용할 수 있는 환경을 제공하고 싶었습니다.",
      "데이터 분석 및 기계 학습 기술에 대한 관심도 가지고 있습니다. 이 프로젝트에서는 크롤링과 자연어 처리(NLP) 등의 기술을 활용하여 대량의 뉴스 데이터를 수집하고 분석하는 작업이 필요했습니다. 따라서 데이터 과학과 관련된 지식과 기술 스택을 익힐 수 있는 좋은 기회였습니다. 위와 같은 계기로 인해 저는 뉴스트 트렌드 분석 서비스 프로젝트에 참여하여 사용자들에게 유익하며 직관적인 경험을 제공하는 웹 애플리케이션을 개발하는 것에 열정과 동기부여를 갖게 되었습니다."
    ],
    "fe": "Front-End : JavaScript, React, Redux, Swiper, Toastify, Slick-carousel, Sass, Amcharts, D3, React-wordcloud, ApexCharts, Recharts",
    "be": "Back-End : Spring boot, MySQL, JWT",
    "role": [
      "Front-End : 2명",
      "Back-End : 2명",
      "Crawling : 1명",
      "데이터 정제 : 1명"
    ],
    "function": [
      "메인화면",
      "지역별 기사 확인하기",
      "기업별 주가정보 및 기사 확인하기",
      "기자별 작성 기사 확인하기"
    ],
    "function2": ["", "", "", ""]
  },
  {
    "name": "My PC",
    "img": 3,
    "summary": "My PC는 사진 또는 키오스크를 통해 빠르고 간편하게 자신의 퍼스널 컬러를 진단할 수 있고, 진단을 통해 사용자의 제품 선택을 보조해주는 플랫폼입니다. 이 프로젝트를 통해 React 학습을 시작했고, React를 활용한 첫 프로젝트입니다. 초기에는 낮설었지만 반복 학습을 통해 React의 기본적인 구조와 동작 원리에 대해 이해하게 되었습니다.",
    "background": [
      "옷이나 화장품과 같은 제품을 선택할 때 자신의 퍼스널 컬러를 고려하는 것은 매우 중요합니다. 각각의 사람은 얼굴, 피부, 머리카락 등의 색상과 조합에 따라 어울리는 컬러가 다릅니다. 그러나 많은 사람들이 자신의 퍼스널 컬러를 정확하게 알지 못하거나 판단하기 어렵다는 문제가 있습니다. 따라서 저는 사용자들이 빠르고 간편하게 자신의 퍼스널 컬러를 진단할 수 있는 방법을 제공하는 플랫폼을 개발하기로 결정했습니다. 이를 통해 사용자들은 사진 또는 키오스크를 활용하여 자신의 퍼스널 컬러를 진단할 수 있으며, 해당 결과에 기반하여 옷이나 화장품 등 다양한 제품을 선택하는 데 도움을 받을 수 있습니다.",
      "사용자 경험(UX) 개선과 시각적인 요소에 대한 관심도 가지고 있습니다. 프론트엔드 개발자로서 인터랙션과 디자인 요소에 신경쓰는 것이 중요하다고 생각합니다. 이 프로젝트에서도 사용자들이 즐겁고 직관적으로 서비스를 이용할 수 있는 인터페이스와 시각화 기능을 구현하기 위해 노력하였습니다.",
      "데이터 분석과 기계 학습 기술에 대한 관심도 가지고 있습니다. 해당 프로젝트에서는 이미지 처리 및 분류 알고리즘, 데이터 마이닝 등 다양한 기술과 지식이 필요합니다. 따라서 데이터 과학 및 기계 학습 분야에서 경험을 쌓기 위해 도전적인 프로젝트로 참여하게 되었습니다. 위와 같은 계기로 인해 저는 자신의 퍼스널 컬러 진단 및 제품 선택 보조 서비스를 위한 프로젝트에 참여하여 사용자들에게 유익하면서도 시각적으로 매력적인 경험을 제공하는 웹 애플리케이션 개발에 열정과 동기부여를 갖게 되었습니다."
    ],
    "fe": "Front-End : JavaScript, React, Redux, Sass, MUI, styled-components, file-loader, formik ,Yup",
    "be": "Back-End : Node.js, Express, MySQL, python-shell, multer, moment",
    "role": ["Full-Stack : 2명", "머신러닝: 1명", "임베디드 : 2명"],
    "function": ["게시판", "퍼스널컬러 진단하기", "화장해보기", "내 프로필"],
    "function2": ["", "", "", ""]
  },
  {
    "name": "YB MOVIE",
    "img": 4,
    "summary": "YB MOVIE는 데이터 기반 영화 추천 서비스 입니다. 사용자는 영화에 대한코멘트를 남길 수 있으며, 영화 이상형월드컵을 이용해 사용자가선호하는 장르를 파악하여 영화를 추천해주는 서비스입니다.",
    "background": [
      "영화는 많은 사람들에게 큰 관심과 즐거움을 주는 예술 형태입니다. 그러나 너무 많은 영화가 있어서 사용자들이 어떤 영화를 선택해야 할지 결정하기 어렵다는 문제가 있습니다. 이러한 문제를 해결하고자 저희 팀은 데이터 기반의 영화 추천 서비스를 개발하기로 결정했습니다.",
      "사용자들의 선호도와 취향을 파악하여 최적의 영화를 추천하는 것은 사용자 경험(UX) 개선에 큰 도움이 됩니다. 저희 팀은 이러한 선호도 파악을 위해 영화에 대한 코멘트 시스템과 장르별 이상형 월드컵을 도입하여 사용자들이 좋아하는 장르와 관련된 영화를 추천하는 기능을 개발하였습니다. 이를 통해 사용자들이 보다 만족할 수 있는 영화 추천 서비스를 제공하고자 했습니다.",
      "데이터 분석 및 기계 학습 분야에 대한 관심도 가지고 있습니다. 해당 프로젝트에서는 다양한 데이터 소스와 알고리즘을 활용하여 사용자들의 선호도와 취향을 파악하고, 그에 맞춰 최적의 영화 추천 결과를 도출하는 작업이 필요합니다. 따라서 저는 데이터 분석 및 기계 학습 기술 습득과 응용의 경험이 필요한 프로젝트로 참여하게 되었습니다. 위와 같은 계기로 인해 저는 YB MOVIE라는 데이터 기반 영화 추천 서비스 프로젝트에 참여하여 사용자들이 더 나은 영화 경험과 만족감을 얻을 수 있는 웹 애플리케이션을 개발하는 것에 열정과 동기부여를 갖게 되었습니다."
    ],
    "fe": "Front-End : JavaScript, Vue.js, Vuex, Vuetify, Bootstrap",
    "be": "Back-End : Django",
    "role": ["Front-End : 1명", "Back-End : 1명"],
    "function": [
      "영화 상세정보",
      "영화 월드컵",
      "월드컵 결과 기반 영화 추천",
      "평가 및 추천",
      "검색 및 북마크"
    ],
    "function2": ["", "", "", "", ""]
  },
  {
    "name": "Portfolio",
    "img": 5,
    "summary": "취업을 목적으로 한 개인 포트폴리오 제작 사이트입니다. JavaScript와 React를 이용해 제작했으며 Swiper 라이브러리를 사용하여 Front단을 구성했고, Firebase의 Hosting을 이용해 배포했습니다.",
    "background": [
      "초기에는 React를 활용하여 포트폴리오를 만드는 데에 의미를 두고 큰 열정 없이 포트폴리오를 제작했습니다. 2주 집중해서 간단하게 제작하고 나니 맘에 안드는 곳 투성이였습니다."
    ],
    "fe": "Front-End : JavaScript, React, Toastify, Swiper, Sass, styled-components",
    "de": "Deploy : Firebase",
    "role": ["Front-End & Deploy : 1명"],
    "function": ["About", "Skills", "Projects", "contact"],
    "function2": ["", "", "", ""]
  }
]
